#### Install Libaries

In [1]:
!pip install pandas
!pip install numpy

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: numpy in c:\users\admin\anaconda3\lib\site-packages (2.1.3)

In [2]:
!pip install psycopg2-binary sqlalchemy pandas

Requirement already satisfied: psycopg2-binary in c:\users\admin\anaconda3\lib\site-packages (2.9.11)
Requirement already satisfied: sqlalchemy in c:\users\admin\anaconda3\lib\site-packages (2.0.39)
Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\admin\anaconda3\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\admin\anaconda3\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
import psycopg2 as ps

#### import Libaries

In [4]:
import pandas as pd
import numpy as np

#### Extration of data

In [5]:
df = pd.read_csv(r'./Sales Dataset.csv')

In [6]:
df.columns

Index(['Order ID', 'Amount', 'Profit', 'Quantity', 'Category', 'Sub-Category',
       'PaymentMode', 'Order Date', 'CustomerName', 'State', 'City',
       'Year-Month'],
      dtype='object')

In [7]:
df.columns = (
    df.columns.str.strip()
               .str.lower()
               .str.replace('-', '_', regex=True)
               .str.replace(' ', '_', regex=True)
)

In [8]:
df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   object
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [10]:
df = df.drop_duplicates().reset_index(drop=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   object
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [11]:
df['order_date'] = pd.to_datetime(df['order_date'], format='%d/%m/%Y', errors='coerce' ) #formarting the order_date column to a date and time dataType
df['year_month'] = pd.to_datetime(df['year_month'], format='%Y-%m', errors='coerce')  #formarting the year_month column to a date and time dataType
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   datetime64[ns]
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(7)
memory usage: 112.1+ KB

In [12]:
df['match'] = (df['order_date'].dt.year == df['year_month'].dt.year) & \
              (df['order_date'].dt.month == df['year_month'].dt.month) #checking if the order_date == year_month

print(df['match'].drop_duplicates()) # droroping duplicate in the compare to see if we have a false but all are True so the both data are same so i can drop the year month column.

0    True
Name: match, dtype: bool

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   datetime64[ns]
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   datetime64[ns]
 12  match         1194 non-null   bool
dtypes: bool(1), datetime64[ns](2), int64(3), object(7)
memory usage: 113.2+ KB

In [14]:
df = df.drop('match', axis='columns') # droping the match testing column 
df = df.drop('year_month', axis='columns') # droping the duplicated column

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   datetime64[ns]
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
dtypes: datetime64[ns](1), int64(3), object(7)
memory usage: 102.7+ KB

In [16]:
df[['first_name', 'last_name']] = df['customername'].str.split(' ', n=1, expand=True)

In [ ]:
df
df.to_csv('clean_sales_data.csv', index=False)
df.to_excel('clean_sales_data.xlsx', index=False)

In [40]:
df_products = df[['category', 'sub_category']].drop_duplicates().reset_index(drop=True)
df_products['product_id'] = df_products.index + 1
df_products = df_products[['product_id', 'category', 'sub_category']]
df_products
df_products.to_csv('df_products.csv', index=False)
df_products.to_excel('df_products.xlsx', index=False)

In [41]:
df_customers = (
    df[['first_name', 'last_name', 'state', 'city']]
    .drop_duplicates()
    .reset_index(drop=True)
)
df_customers['customer_id'] = df_customers.index + 1
# df_customers[['first_name', 'last_name']] = df_customers['customername'].str.split(' ', n=1, expand=True)
df_customers = df_customers[['customer_id', 'first_name', 'last_name', 'state', 'city']]
df_customers

df_customers.to_csv('df_customers.csv', index=False)
df_customers.to_excel('df_customers.xlsx', index=False)

In [42]:
df_orderss = (
    df[['order_id', 'order_date', 'amount', 'paymentmode', 'quantity', 'first_name', 'last_name', 'sub_category', 'state', 'city', 'profit']]
    .merge(df_customers[['customer_id', 'first_name', 'last_name', 'state', 'city']], 
           left_on=['first_name', 'last_name', 'state', 'city'], 
           right_on=['first_name', 'last_name', 'state', 'city'], 
           how='left', validate='many_to_one')
    .merge(df_products[['product_id', 'sub_category']], on='sub_category', how='left', validate='many_to_one')
)
df_orderss['cost_per_unit'] = np.where(
    df_orderss['quantity'] != 0,
    ((df_orderss['amount'] - df_orderss['profit']) / df_orderss['quantity']).round(2),
    np.nan
)
df_orderss.insert(0, 'order_pk', df_orderss.index + 1)
df_orderss['price'] = (df_orderss['amount'] / df_orderss['quantity']).round(2)
df_orders = df_orderss[['order_pk', 'order_id', 'order_date', 'amount', 'paymentmode', 'quantity', 'customer_id', 'product_id', 'price']]

df_orders

df_orders.to_csv('df_orders.csv', index=False)
df_orders.to_excel('df_orders.xlsx', index=False)

In [43]:

df_revenue = (
    df_customers[['customer_id']]
            .merge(df_orderss[['order_pk', 'order_id',
       'customer_id', 'product_id', 'profit', 'cost_per_unit']], on='customer_id', how='left')
            .merge(df_products[[ 'product_id']], on='product_id', how='left')
                  )

df_revenue['revenue_id'] = df_revenue.index + 1
df_revenue = df_revenue[['revenue_id', 'customer_id', 'order_pk', 'product_id', 'cost_per_unit', 'profit']]

df_revenue

df_revenue.to_csv('df_revenue.csv', index=False)
df_revenue.to_excel('df_revenue.xlsx', index=False)

In [44]:
df_fact_table = (
    df_customers[['customer_id']]
            .merge(df_orderss[['order_pk', 'order_id', 'order_date', 'amount', 'paymentmode', 'quantity',
       'customer_id', 'product_id', 'price', 'profit', 'cost_per_unit']], on='customer_id', how='left')
            .merge(df_products[['category', 'sub_category' , 'product_id']], on='product_id', how='left')
          #   .merge(df[['profit', 'amount', 'order_date','order_id', 'first_name', 'last_name', 'state', 'city']], on=['first_name', 'last_name', 'state', 'city'],  how='left', validate='many_to_many'). reset_index(drop=True)
                 
                 )
df_fact_table['month_name'] = df_fact_table['order_date'].dt.strftime('%B')
df_fact_table['transaction_id'] = df_fact_table.index + 1
# df_fact_table = df_fact_table[['order_id', 'customer_id', 'city', 'category', 'sub_category', 'paymentmode', 'order_date', 'amount', 'profit', 'quantity']]
df_fact_table = df_fact_table[['transaction_id', 'customer_id', 'order_pk', 'order_date', 'amount', 'paymentmode',
       'quantity', 'product_id', 'price', 'profit', 'cost_per_unit',
       'category', 'sub_category', 'month_name']]
df_fact_table


df_fact_table.to_csv('df_fact_table.csv', index=False)
df_fact_table.to_excel('df_fact_table.xlsx', index=False)

In [23]:
profit_loss = (
    df_customers[['customer_id', 'city']]
            .merge(df_fact_table[['customer_id', 'amount', 'profit', 'category']], on='customer_id', how='left')
            
    .groupby(['customer_id', 'city', 'category'])
    .agg(total_sales = ('amount', 'sum'),
         total_profit = ('profit', 'sum'))
         .reset_index()
)
profit_loss['status'] = ''
profit_loss['profit_margin_percentage'] = ''

for i in range(len(profit_loss['total_profit'])):
    if profit_loss.loc[i, 'total_profit'] > 0:
        profit_loss.loc[i, 'status'] = 'Profit'
    else:
        profit_loss.loc[i, 'status'] = 'Loss'

for i in range(len(profit_loss['total_profit'])):
    profit_loss.loc[i, 'profit_margin_percentage'] = ((profit_loss.loc[i, 'total_profit']/profit_loss.loc[i, 'total_sales']) *100).round(2)
        

profit_loss

,customer_id,city,category,total_sales,total_profit,status,profit_margin_percentage
0,1,Miami,Electronics,14701,2605,Profit,17.72
1,2,Chicago,Electronics,14701,2605,Profit,17.72
2,3,Buffalo,Electronics,14701,2605,Profit,17.72
3,4,Orlando,Office Supplies,1525,185,Profit,12.13
4,5,Miami,Office Supplies,1525,185,Profit,12.13
...,...,...,...,...,...,...,...
1029,803,New York City,Furniture,8825,3594,Profit,40.73
1030,804,Rochester,Electronics,2082,642,Profit,30.84
1031,805,Austin,Electronics,2082,642,Profit,30.84
1032,806,Buffalo,Electronics,2082,642,Profit,30.84
1033,807,Chicago,Office Supplies,914,163,Profit,17.83

In [ ]:
month_profit_category = (
    df_fact_table.groupby(['order_date', 'category'])['profit']
            .sum()
            .reset_index()
            .sort_values('profit', ascending=False)
                ).reset_index(drop=True)
month_profit_category

    order_date         category  profit
0   2023-03-21      Electronics   11169
1   2023-09-27      Electronics    8840
2   2025-01-30      Electronics    8840
3   2022-04-15  Office Supplies    8742
4   2023-12-28      Electronics    8389
..         ...              ...     ...
935 2021-11-20  Office Supplies      58
936 2025-03-15      Electronics      58
937 2022-12-16        Furniture      55
938 2021-09-06        Furniture      55
939 2021-05-25        Furniture      54

[940 rows x 3 columns]

In [25]:
monthly_profit = (
    df_fact_table.groupby('month_name')['profit']
      .sum()
      .reset_index()
      .sort_values('month_name')
      .reset_index(drop=True)
)

monthly_profit

   month_name  profit
0       April  139373
1      August  143289
2    December  159816
3    February  118941
4     January  110381
5        July  132117
6        June  141845
7       March  152739
8         May  129629
9    November  116169
10    October  155154
11  September  111244

In [26]:
top_customers = (
    df_customers[['customer_id', 'first_name', 'last_name']]
    .merge(df_fact_table[['customer_id', 'profit']], on='customer_id').reset_index(drop=True)
    .groupby(['first_name', 'last_name'])['profit']
              .sum()
              .reset_index()
              .sort_values('profit', ascending=False)
              .reset_index(drop=True)
)
top_customers

    first_name         last_name  profit
0    Stephanie           Manning    8840
1        Logan          Galloway    8840
2         Cory             Evans    7790
3          Mr.  Ralph Garcia Jr.    7275
4     Nicholas           Johnson    7198
..         ...               ...     ...
797        Dr.    Terry Alvarado      58
798   Michelle          Williams      55
799        Jon             Banks      55
800   Victoria         Bryant MD      54
801    Russell            Austin      52

[802 rows x 3 columns]

In [27]:
quantity_per_category  = (
    df_products[['category']].merge(df_fact_table[['category', 'quantity']], )
    .groupby([ 'category'])['quantity']
              .sum()
              .reset_index()
              .sort_values('quantity', ascending=False)
              .reset_index(drop=True)
)
quantity_per_category

          category  quantity
0        Furniture     17764
1      Electronics     17032
2  Office Supplies     16184

In [28]:
city_with_low_profit = (
    df_customers[['customer_id', 'city']].merge(df_fact_table[['customer_id', 'profit']])
    .groupby([ 'city'])['profit']
              .sum()
              .reset_index()
              .sort_values('profit', ascending=True)
              .reset_index(drop=True)
)

city_with_low_profit

             city  profit
0        Columbus   56277
1     Los Angeles   69264
2           Tampa   70842
3         Houston   72659
4          Peoria   76106
5      Cincinnati   78788
6         Chicago   80061
7       Cleveland   81454
8          Austin   82638
9     Springfield   84205
10  New York City   86954
11      San Diego  101444
12         Dallas  102483
13  San Francisco  108106
14      Rochester  109729
15          Miami  109739
16        Buffalo  111823
17        Orlando  128125

In [61]:
Cities_with_revenue= df_customers[['customer_id', 'city']].merge(df_fact_table[['customer_id', 'cost_per_unit', 'quantity']], on='customer_id', how='left')
# grouped_revenue = df.groupby('Product')['Revenue'].sum()
Cities_with_revenue['revenue'] = Cities_with_revenue['cost_per_unit']*Cities_with_revenue['quantity']
Cities_with_revenue.groupby('city')['revenue'].sum()

city
Austin           252561.15
Buffalo          306691.33
Chicago          264613.94
Cincinnati       225067.94
Cleveland        252765.74
Columbus         190415.25
Dallas           287660.70
Houston          213472.89
Los Angeles      188067.71
Miami            261142.19
New York City    217288.58
Orlando          324033.11
Peoria           187826.00
Rochester        297561.92
San Diego        287659.87
San Francisco    331893.75
Springfield      285926.34
Tampa            197292.97
Name: revenue, dtype: float64

In [45]:
df_fact_table

,transaction_id,customer_id,order_pk,order_date,amount,paymentmode,quantity,product_id,price,profit,cost_per_unit,category,sub_category,month_name
0,1,1,1,2023-06-27,9726,UPI,5,1,1945.20,1275,1690.20,Electronics,Electronic Games,June
1,2,1,4,2023-06-27,4975,UPI,14,2,355.36,1330,260.36,Electronics,Printers,June
2,3,2,2,2024-12-27,9726,UPI,5,1,1945.20,1275,1690.20,Electronics,Electronic Games,December
3,4,2,5,2024-12-27,4975,UPI,14,2,355.36,1330,260.36,Electronics,Printers,December
4,5,3,3,2021-07-25,9726,UPI,5,1,1945.20,1275,1690.20,Electronics,Electronic Games,July
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1189,1190,803,1190,2024-07-31,8825,Debit Card,15,5,588.33,3594,348.73,Furniture,Tables,July
1190,1191,804,1191,2020-06-02,2082,EMI,8,11,260.25,642,180.00,Electronics,Phones,June
1191,1192,805,1192,2022-12-15,2082,EMI,8,11,260.25,642,180.00,Electronics,Phones,December
1192,1193,806,1193,2020-08-07,2082,EMI,8,11,260.25,642,180.00,Electronics,Phones,August
1193,1194,807,1194,2024-10-26,914,UPI,13,7,70.31,163,57.77,Office Supplies,Markers,October

In [29]:
from sqlalchemy import create_engine, Column, Integer, String, Float, ForeignKey, Date
from sqlalchemy.orm import declarative_base, relationship, sessionmaker
Base = declarative_base()

In [30]:
engine = create_engine(
    f'postgresql+psycopg2://{'postgres'}:{''}@{'localhost'}:{'5432'}/{'sales_intelligence'}'
)
print("✅ SQLAlchemy engine created successfully!")

✅ SQLAlchemy engine created successfully!

In [ ]:
class Product(Base):
    __tablename__ = 'products'
    
    product_id = Column(Integer, primary_key=True, autoincrement=True)
    category = Column(String(50))
    sub_category = Column(String(50))
 
    
    # # Relationship to orders
    # orders = relationship("Order", back_populates="product")

Base.metadata.create_all(engine)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [ ]:
class Customer(Base):
    __tablename__ = 'customers'
    
    customer_id = Column(Integer, primary_key=True, autoincrement=True)
    first_name = Column(String(50))
    last_name = Column(String(50))
    city = Column(String(50))
    state = Column(String(50))
    
    # Relationship to orders
    # orders = relationship("Order", back_populates="customer")

Base.metadata.create_all(engine)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [33]:
class Orders(Base):
    __tablename__ = 'orders'
    
    order_pk = Column(Integer,  primary_key=True,  autoincrement=True)
    order_id = Column(String(8))
    order_date = Column(Date)
    amount = Column(Integer)
    paymentmode = Column(String(50))
    quantity = Column(Integer)
    customer_id = Column(Integer, ForeignKey('customers.customer_id'))
    product_id = Column(Integer, ForeignKey('products.product_id'))
    price = Column(Float)

Base.metadata.create_all(engine)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [34]:
class Revenue(Base):
    __tablename__ = 'revenue'
    
    revenue_id = Column(Integer, primary_key=True, autoincrement=True)
    customer_id = Column(Integer, ForeignKey('customers.customer_id'))
    order_pk = Column(Integer, ForeignKey ('orders.order_pk'))
    product_id = Column(Integer, ForeignKey('products.product_id'))
    cost_per_unit = Column(Float)
    profit = Column(Integer)
    
    

Base.metadata.create_all(engine)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [35]:
df_products.to_sql('products', engine, if_exists='append', index=False)
df_customers.to_sql('customers', engine, if_exists='append', index=False)
df_orders.to_sql('orders', engine, if_exists='append', index=False)
df_revenue.to_sql('revenue', engine, if_exists='append', index=False)

194